Dlubal.DynamPro.IDynamResults
Interface for working with Dynam results.

Dlubal.DynamPro.IDynamResults.GetNVCMassesOnNode(System.Int32,System.Int32)
Fetches masses of given NVC
Returns: structure containing masses for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned
NodeNo: Number of node (or FE Point in RFEM)

Dlubal.DynamPro.IDynamResults.GetNVCMassesOnFEPoint(System.Int32,System.Int32)
Fetches masses of given NVC (RFEM only)
Returns: structure containing masses for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned
FEPointNo: Number of FE Point

Dlubal.DynamPro.IDynamResults.GetNVCModeShapesOnNode(System.Int32,System.Int32,System.Int32)
Fetches Mode Shape results of given NVC
Returns: structure containing modeshape-related results for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned
ModeShape: Number of ModeShape whose results shall be returned
NodeNo: Number of Node in which the results shall be returned (or FE Point in RFEM)

Dlubal.DynamPro.IDynamResults.GetNVCModeShapesOnFEPoint(System.Int32,System.Int32,System.Int32)
Fetches Mode Shape results of given NVC (RFEM only)
Returns: structure containing modeshape-related results for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned
ModeShape: Number of ModeShape whose results shall be returned
FEPointNo: Number of FE Point

Dlubal.DynamPro.IDynamResults.GetNVCModeShapesOnMember(System.Int32,System.Int32,System.Int32)
Fetches Mode Shape results of given NVC
Returns: structure containing modeshape-related results for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned
ModeShape: Number of ModeShape whose results shall be returned
MemberNo: Number of Member in which the results shall be returned

Dlubal.DynamPro.IDynamResults.GetNVCModeShapesOnSurface(System.Int32,System.Int32,System.Int32)
Fetches Mode Shape results of given NVC
Returns: structure containing modeshape-related results for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned
ModeShape: Number of ModeShape whose results shall be returned
SurfaceNo: Number of Surface in which the results shall be returned

Dlubal.DynamPro.IDynamResults.GetAllNVCNaturalFrequencies(System.Int32)
Fetches all Eigenvalue results of given NVC
Returns: structure containing eigenvalues for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned

Dlubal.DynamPro.IDynamResults.GetAllNVCMasses(System.Int32)
Fetches all masses of given NVC
Returns: structure containing masses for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned

Dlubal.DynamPro.IDynamResults.GetAllNVCModeShapes(System.Int32)
Fetches all Mode Shape results of given NVC
Returns: structure containing modeshape-related results for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned

Dlubal.DynamPro.IDynamResults.GetAllNVCMassFactors(System.Int32)
Fetches all Mass factors results of given NVC
Returns: structure containing mass-results for given NVC and modeshape
NVCNo: Number of NVC whose results shall be returned